_posts/2022-03-13-post-fundamentals.html
---
title:  Fundamentals revesited.
categories:
  - blog
tags:
    - basics
---

<p>
As I now subscribed to THM, I can finally finish the basics Rooms. On the one Hand this is the same as I do on INE, but on the otherhand, this is the stuff
I really need to understand, and to be honest, I learned something new today&#x2026; so definitly worth to revisit again.
</p>

<p>
Especially as it is made really fun, the challenges and the Labs, are mostly simple, but they really show the basic principals.
Sometimes I feel they are too simple, but on the otherhand, there are also a lot of members with no prior knowledge.
</p>

<p>
So to sum, what was coverd today, mostly to finally remeber the Acronymes.
</p>

<dl class="org-dl">
<dt>Authentication Bypass</dt><dd></dd>

<dt>IDOR</dt><dd>Insecure Direct Object Reference</dd>
<dt>SSRF</dt><dd>Server-Side Request Forgery</dd>
<dt>File Inclusion</dt><dd></dd>
</dl>

<p>
I enjoyed all of them, but I would like to have some more exersises on IDORs
</p>
